Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: ཤཱཀྱའི་ང་རྒྱལ་དང་། སྟོབས་ཀྱི་ང་རྒྱལ་གྱིས་དྲེགས་ནས། དེས་གླང་པོ་དེ་ལག་པ་གཡོན་པས་སྣ་ནས་བཟུང་སྟེ། ལག་པ་གཡས་པས་ཐལ་མོ་ལན་ཅིག་བསྣུན་པས་བསད་པར་གྱུར་ཏོ།
en: Intoxicated with jealousy, and drunk with pride about his Śākya family line as well as his own strength, he grabbed hold of the elephant by its trunk with his left hand and killed it with his right hand in a single stroke.

source: །དེའི་འོག་ཏུ་གཞོན་ནུ་མཛེས་དགའ་བོ་བྱུང་བ་དང་། དེས་གླང་པོ་ཆེན་པོ་དེ་གྲོང་ཁྱེར་གྱི་སྒོར་བསད་པ་མཐོང་ནས། སུས་བསད་ཅེས་དྲིས་པ་དང་།
en: Right then the boy Sundarananda arrived. Seeing that an elephant had been killed at the city gate, he asked, “Who killed it?”

source: སྨྲས་པ། ལྷ་སྦྱིན་གྱིས་བསད་དོ།
en: The crowd told him, “It was Devadatta.”

source: །སྨྲས་པ། ལྷ་སྦྱིན་གྱིས་དེ་ནི་མ་ལེགས་པ་ཞིག་བྱས་སོ་ཞེས། དེས་གླང་པོ་དེའི་མཇུག་མ་ནས་བཟུང་སྟེ། གྲོང་ཁྱེར་གྱི་སྒོ་ནས་གུད་དུ་བོར་རོ།
en: Sundarananda said, “That was not right of Devadatta.” Grabbing hold of the elephant by the tail, he dragged it outside the city gate.

source: །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་ཤིང་རྟ་ལ་ཞོན་ཏེ་བྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་གླང་པོ་དེ་ལྟར་བསད་པ་མཐོང་ངོ་།
en: Later the Bodhisattva arrived riding a chariot and noticed the dead elephant.

source: །མཐོང་ནས་ཀྱང་སུས་བསད་ཅེས་དྲིས་པ་དང་། སྨྲས་པ། ལྷ་སྦྱིན་གྱིས་བསད་དོ།
en: When he inquired who had killed the animal, he was told that it was Devadatta.

source: །སྨྲས་པ། ལྷ་སྦྱིན་གྱིས་དེ་ནི་མ་ལེགས་པ་ཞིག་བྱས་སོ།
en: The Bodhisattva said, “That was not good of Devadatta.

source: །གྲོང་ཁྱེར་འདིའི་སྒོ་ནས་སུས་བོར་ཞེས་དྲིས་པ་དང་སྨྲས་པ། མཛེས་དགའ་བོས་བོར་རོ། །
en: Who dragged the elephant outside the city gate?”

source: སྨྲས་པ། མཛེས་དགའ་བོས་དེ་ལྟར་བྱས་པ་ཡང་ལེགས་ན། སེམས་ཅན་འདི་ནི་ལུས་ཆེན་པོ་དང་ལྡན་པ་སྟེ། རུལ་ན་གྲོང་ཁྱེར་ཐམས་ཅད་དྲི་མི་ཞིམ་པས་གང་བར་འགྱུར་རོ་ཞེས་ནས། དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཤིང་རྟ་ལ་འདུག་བཞིན་དུ་རྐང་པ་ཡ་གཅིག་ས་ལ་བརྐྱང་སྟེ། རྐང་པའི་མཐེ་བོས་གླང་པོ་དེ་བླངས་ཏེ། ར་བ་བདུན་རིམ་དང་འོབས་བདུན་རིམ་འདས་ནས་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་རྒྱང་གྲགས་གཅིག་ཙམ་དུ་འཕངས་སོ།
en: When he was then told that it was Sundarananda who had done so, he answered, “It was good that Sundarananda carried it out, but this animal has a huge body. When it decays, the entire city will fill with a horrible stench.” Then, while still on his chariot, the prince extended one foot to the ground, and with his big toe he took hold of the elephant and hurled it a mile outside the city, over seven walls and seven moats.

source: །གླང་པོ་དེ་ཕྱོགས་གང་དུ་ལྷུང་བའི་ཕྱོགས་དེ་ཤོང་ཆེན་པོ་ཞིག་ཏུ་གྱུར་ནས།
en: A deep pit formed where the elephant landed.

source: ད་ལྟར་གླང་པོའི་ཤོང་ཞེས་བྱ་བ་ཡིན་ནོ།
en: Today this is aptly called Elephant Gorge.

source: །དེའི་ཚེ་ལྷ་དང་མི་བརྒྱ་སྟོང་མང་པོ་ཨེ་མ་ཨ་ལ་ལ་ཞེས་ཟེར་ཞིང་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་འབྱིན་ལ། གོས་ཀྱི་གཡབ་མོ་འབྱིན་པར་གྱུར་ཏོ།
en: Then hundreds of thousands of gods and humans let out hundreds of thousands of cries of amazement and waved their banners.

source: །ནམ་མཁའི་དཀྱིལ་ནས་ལྷའི་བུ་དག་གིས་ཀྱང་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: From the sky, gods called out these verses:

source: །གླང་པོའི་དབང་པོ་བདོ་བ་བཞིན་བཞུད་པ།
en: “In a movement like a great elephant in rut,

source: །ཞབས་ཀྱི་མཐེ་བོས་གླང་པོའི་དབང་པོ་བླངས།
en: The Bodhisattva grabbed hold of the great elephant with his big toe

source: །ར་བ་བདུན་དང་འོབས་བདུན་ཡོངས་འདས་ནས། །གྲོང་ཁྱེར་འདི་ཡི་ཕྱི་རོལ་རྒྱང་རིང་འཕངས།
en: And hurled it far outside the fair city, Beyond seven of the city’s moats.

source: །མཁྱེན་པ་མཆོག་མངའ་འདིས་ནི་གདོན་མི་ཟར།
en: “This supremely wise one will surely

source: །ང་རྒྱལ་སྟོབས་ཀྱིས་མཐོ་བའི་ལུས་ཅན་རྣམས།
en: Hurl the people who are bloated with the strength of pride

source: །འཁོར་བའི་གྲོང་ནས་ཕྱི་རོལ་རྒྱང་རིང་དུ།
en: Far beyond the city of saṃsāra,

source: །ཤེས་རབ་སྟོབས་ཀྱིས་འདིས་ནི་འཕེན་པར་འགྱུར།
en: Alone, through the strength of his insight‌.”

source: །དགེ་སློང་དག་དེ་ནས་ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱ་ཙམ་གྲོང་ཁྱེར་ནས་འཐོན་ནས། སའི་ཕྱོགས་གང་དུ་ཤཱཀྱ་གཞོན་ནུ་དག་སྒྱུ་རྩལ་སྟོན་པ་དེར་དོང་ངོ་།
en: Then five hundred Śākya boys emerged from the city and arrived at the place where they were to demonstrate their abilities in the arts.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་དང་། ཤཱཀྱ་རྒན་རབས་རྒན་རབས་དག་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤཱཀྱ་གཞོན་ནུ་གཞན་དག་གི་སྒྱུ་རྩལ་གྱི་ཁྱད་པར་མཐོང་བར་འདོད་དེ་སའི་ཕྱོགས་དེར་དོང་ངོ་།
en: King Śuddhodana, the Śākya elders, and a big crowd also arrived there, eager to compare the differences in artistic skill between the Bodhisattva and the other Śākya boys.

source: །དེ་ནས་ཐོག་མར་ཤཱཀྱ་གཞོན་ནུ་ཡི་གེ་མཁས་ཤིང་ཡི་གེའི་ཆོ་ག་ཤེས་པ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔར་ཡི་གེ་འགྲན་ཏོ། །དེའི་ཚེ་ཤཱཀྱ་དེ་དག་གིས་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་དཔང་དུ་བཞག་སྟེ། གཞོན་ནུ་འདི་དག་གི་ནང་ནས། ཡི་གེ་འབྲུའམ། ཡི་གེའི་སྣ་གྲངས་ཀྱི་མཐར་ཕྱིན་པས་ཁྱད་པར་དུ་འཕགས་པ་གང་ཡིན་ཁྱོད་ཀྱིས་བྱེ་བྲག་ཕྱེ་ཤིག །
en: First those Śākya boys who were skilled in the rules of writing competed with the Bodhisattva in the art of scripts. The teacher Viśvāmitra was appointed judge by the Śākyas, and he announced, “You are to determine who among these boys is superior, whether in penmanship or in the knowledge of scripts.”

source: དེ་ནས་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་བྱང་ཆུབ་སེམས་དཔའ་ཡི་གེ་ལ་མཁས་པ་མངོན་དུ་མཐོང་བས་བཞིན་འཛུམ་པ་བསྟན་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then, because the teacher Viśvāmitra had witnessed firsthand the Bodhisattva’s knowledge of scripts, he smiled and said these verses: “This pure being has reached perfection

source: །མི་ཡི་འཇིག་རྟེན་ལྷ་ཡི་འཇིག་རྟེན་ནམ།
en: In all the scripts, as many as there are in all the worlds,

source: །ལྷ་མིན་འཇིག་རྟེན་དྲི་ཟའི་འཇིག་རྟེན་ནམ།
en: Whether it be the world of humans, the world of gods,

source: །འཇིག་རྟེན་ཀུན་གྱི་ཡི་གེ་ཇི་སྙེད་གང་། །དེ་ལ་སེམས་ཅན་དག་པ་འདིས་མཐར་ཕྱིན།
en: The world of demigods, or the world of gandharvas.

source: །མི་ཡི་ཟླ་བ་འདི་ཡིས་གང་མཁྱེན་པའི། །ཡི་གེ་དག་དང་ཡི་གེའི་སྣ་གྲངས་ཀྱི། །མིང་ཡང་ཁྱེད་དང་ངས་ནི་ཡོང་མི་ཤེས།
en: “Neither you nor I know even the names Of the scripts and letters That this moon among men knows.

source: །འདི་ལ་མངོན་སུམ་ངས་ཤེས་འདི་རྒྱལ་འགྱུར།
en: I have witnessed it firsthand. He will be victorious.”

source: །ཤཱཀྱ་རྣམས་ཀྱིས་སྨྲས་པ། གཞོན་ནུ་འདི་ཡི་གེའི་ཤེས་པ་ལ་ཁྱད་པར་དུ་འཕགས་པ་ལྟའང་འཕགས་པར་ཆུག་སྟེ། གཞོན་ནུ་འདི་གྲངས་ཀྱིས་ཤེས་པ་ལ་ཁྱད་པར་ཅི་ཡོད་འགྲན་པར་བྱའོ། །དེ་ནས་ཤཱཀྱ་སྲིད་སྒྲུབ་ཅེས་བྱ་བ་རྩིས་པ་ཆེན་པོ་བྱེད་པ་བགྲང་བ་དང་། རྩིས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞིག་ཡོད་པ་དེ་དཔང་དུ་བཞག་སྟེ། གཞོན་ནུ་འདི་དག་གི་ནང་ནས་གྲངས་ཀྱི་ཤེས་པ་ལ་ཁྱད་པར་དུ་གང་འཕགས་ཁྱོད་ཀྱིས་ལྟོས་ཤིག་ཅེས་བྱས་ཏེ།
en: The Śākyas said, “It may indeed be that this boy is superior in knowledge of scripts, but he should also be tested and distinguish himself in knowledge of mathematics.” So the greatest mathematician among the Śākyas, a man called Arjuna, an adept in knowledge of calculation, was appointed judge and told, “You are to determine who among the boys here is superior in knowledge of numbers.”

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་ནི་རྩིས་མགོ་ཕོག །ཤཱཀྱ་གཞོན་ནུ་གཅིག་གིས་ནི་བརྩིས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་སླེབས་པར་མ་ནུས་སོ།
en: First the Bodhisattva proposed a mathematical problem. One of the Śākya boys tried to calculate it, but he could not solve it.

source: །དེ་ནས་ཤཱཀྱ་གཞོན་ནུ་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། བརྒྱ་ནས། ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱའི་བར་གྱིས་དུས་གཅིག་ཏུ་བརྩིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མ་སླེབས་སོ།
en: Next another Śākya boy, then two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred—up to five hundred of them—together tried to calculate the problem, but they could not solve it.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁྱེད་ཀྱིས་ནི་རྩིས་མགོ་ཕོག་ཤིག །ཁོ་བོས་ནི་བརྩིའོ། །དེའི་ཚེ་ཤཱཀྱ་གཞོན་ནུ་གཅིག་གིས་རྩིས་མགོ་ཕོག་ན། བྱང་ཆུབ་སེམས་དཔས་རྩིས་ཀྱི་ཆོད་པ་ལ་མ་སླེབས་སོ།
en: Next the Bodhisattva said, “Now you propose a mathematical problem, and I will calculate it.” One of the Śākya boys proposed a mathematical problem to the Bodhisattva, but the boy could not confound the Bodhisattva’s calculations.

source: །དེ་ནས་ཤཱཀྱ་གཞོན་ནུ་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། བརྒྱ་ནས་ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱའི་བར་གྱིས་དུས་གཅིག་ཏུ་རྩིས་མགོ་ཕོག་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་རྩིས་ཀྱི་ཆོད་པ་ལ་མ་སླེབས་སོ།
en: Next two of the Śākya boys, then three, four, five, ten, twenty, thirty, forty, fifty—up to five hundred of them—together proposed a mathematical problem, but they could not confound the Bodhisattva’s calculations.

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། འདི་ལ་བརྩད་དེ་ཡང་ཅི་རུང་གིས། ཁྱེད་ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ་རྩིས་མགོ་ཕོག་ཤིག་དང་། ཁོ་བོས་ནི་བརྩིའོ།
en: Finally the Bodhisattva said, “Enough with this dispute! All of you should convene and propose a mathematical problem for me. Then I will calculate it.”

source: །དེ་ནས་ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱས་ཚིག་གཅིག་ཏུ་བརྗོད་པས་སྔ་ཕྱི་མེད་པར་རྩིས་མགོ་ཕོག་ན། བྱང་ཆུབ་སེམས་དཔས་རྨོངས་པ་མེད་པར་བརྩིས་ཏེ།
en: Accordingly five hundred Śākya boys in unison proposed an unprecedented problem, and still the Bodhisattva calculated it without any consternation.

source: དེ་ལྟར་ཤཱཀྱ་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ནི་ཕུག་ཐུག་པར་གྱུར། བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་ཐུག་པའི་མཐའ་མེད་པར་གྱུར་ཏོ།
en: In this way all the Śākya boys met their match while the Bodhisattva remained undefeated.

source: །དེ་ནས་རྩིས་པ་ཆེན་པོ་སྲིད་སྒྲུབ་ངོ་མཚར་དུ་གྱུར་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: The great mathematician Arjuna was amazed and said these verses:

source: །ལེགས་པའི་བློ་མངའ་འདི་དྲིས་ན།
en: “When this fine intellect was questioned,

source: །མཁྱེན་པ་ཤིན་ཏུ་མྱུར་བ་སྟེ།
en: His knowledge was so very quick

source: །ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱ་ཙམ།
en: That all five hundred Śākya boys

source: །ཀུན་ཀྱང་རྩིས་ཀྱི་ལམ་ལ་ཐུག
en: Were surpassed on the path of calculation.

source: །དེ་ཡི་ཤེས་རབ་འདི་འདྲ་སྟེ། །ཡེ་ཤེས་བློ་གྲོས་དྲན་ལྡན་ཡང་། །རྩིས་ཀྱི་མཁྱེན་པ་རྒྱ་མཚོ་དེ། །ད་དུང་སྦྱོང་ཞིང་སློབ་པ་མཛད།
en: “With such insight, wisdom, Intellect, and mindfulness, This ocean of knowledge Even today learns and trains further in calculation.”

source: །དེ་ནས་ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་ངོ་མཚར་དུ་གྱུར་ཏེ། ཤིན་ཏུ་རྨད་དུ་བྱུང་བར་སེམས་ཤིང་། དེའི་ཚེ་ཐམས་ཅད་མགྲིན་གཅིག་ཏུ་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་དོན་གྲུབ་གཞོན་ནུ་ཁྱོད་ནི་རྒྱལ་ལོ་རྒྱལ་ལོ་ཞེས་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ། ཐལ་མོ་སྦྱར་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཏེ་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The whole Śākya assembly was shocked and amazed, and they all said in unison, “O Prince Sarvārthasiddha, you have won, you have won!” All of them stood up from their seats, and with palms joined paid homage to the Bodhisattva.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ལ་སྲས་དེ་ལྟར་དྲིས་པ་ལ་སྤོབས་པ་མྱུར་ཞིང་མགྱོགས་ལ། ཡང་ཞིང་ཤུགས་དང་ལྡན་པ་ཅན་མངའ་བ་ནི་བརྙེས་པ་ལེགས་པར་བརྙེས་སོ།
en: Then they addressed King Śuddhodana: “Great King, you are so fortunate to have a son whose eloquent self-confidence is so swift, nimble, subtle, and potent in the face of questions.”

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་རྩིས་པ་ཆེན་པོ་སྲིད་སྒྲུབ་གྲངས་ཀྱི་ཤེས་པ་ལ་མཁས་པ་དང་། རྩིས་ཀྱི་ལུགས་འགྲན་ནུས་སམ།
en: King Śuddhodana then said to the Bodhisattva, “Son, can you match the ways of calculation with the great mathematician Arjuna, an expert in the knowledge of numbers?”

source: སྨྲས་པ། ལྷ་རྔོ་ཐོག་གོ།
en: “I can, Your Majesty,” responded the Bodhisattva.

source: །སྨྲས་པ་འོ་ན་རྩིས་ཤིག །དེ་ནས་རྩིས་པ་ཆེན་པོ་སྲིད་སྒྲུབ་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then calculate away!” commanded the king.

source: །གཞོན་ནུ་ཁྱོད་བྱེ་བ་ལས་བརྒྱར་གོང་དུ་བསྒྲེས་པ་ཞེས་བགྱི་བའི་རྩིས་ཀྱི་ལུགས་མཁྱེན་ཏམ།
en: The great mathematician Arjuna then asked the Bodhisattva, “Child, do you know how to calculate the number called ten million to the hundredth power?”

source: སྨྲས་པ། ཤེས་སོ། །
en: “Yes, I do,” said the Bodhisattva.

source: སྨྲས་པ། འོ་ན་བྱེ་བ་ལས་བརྒྱར་གོང་དུ་བསྒྲེས་པའི་རྩིས་ཀྱི་ལུགས་ལ་ཇི་ལྟར་རྗེས་སུ་འཇུག་པར་བགྱི།
en: “How then,” asked Arjuna, “should one commence that calculation?”

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བྱེ་བ་ཕྲག་བརྒྱ་ན་ཐེར་འབུམ་ཞེས་བྱའོ། །ཐེར་འབུམ་ཕྲག་བརྒྱ་ན་ཁྲག་ཁྲིག་ཅེས་བྱའོ།
en: The Bodhisattva replied, “One hundred times ten million is called a billion (ayuta). One hundred times one billion is called one hundred billion (niyuta).

source: །ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་ན་གཏམས་པ་ཞེས་བྱའོ།
en: One hundred times one hundred billion is called one quadrillion (kañkara).

source: །གཏམས་པ་ཕྲག་བརྒྱ་ན་དཀྲིགས་པ་ཞེས་བྱའོ།
en: One hundred quadrillions is called one sextillion (vivara).

source: །དཀྲིགས་པ་ཕྲག་བརྒྱ་ན་མི་འཁྲུགས་པ་ཞེས་བྱའོ།
en: One hundred sextillions is called a nonillion (akṣobhya).

source: །མི་འཁྲུགས་པ་ཕྲག་བརྒྱ་ན་ཁྱད་ཕྱིན་ཅེས་བྱའོ།
en: One hundred nonillions is called a vivāha.

source: །ཁྱད་ཕྱིན་ཕྲག་བརྒྱ་ན་ཕང་སྟེང་ཞེས་བྱའོ།
en: One hundred vivāhas is called an utsañga.

source: །ཕང་སྟེང་ཕྲག་བརྒྱ་ན་མང་འཛིན་ཅེས་བྱའོ།
en: One hundred utsañgas is called a bahula.

source: །མང་འཛིན་ཕྲག་བརྒྱ་ན་གླང་པོའི་སྟོབས་ཞེས་བྱའོ།
en: One hundred bahulas is called a nāgabala.

source: །གླང་པོའི་སྟོབས་ཕྲག་བརྒྱ་ན་ངོགས་འཐོབ་ཅེས་བྱའོ།
en: One hundred nāgabalas is called a tiṭilambha.

source: །ངོགས་འཐོབ་ཕྲག་བརྒྱ་ན་རྣམ་པར་གཞག་པ་གདགས་པ་ཞེས་བྱའོ།
en: One hundred tiṭilambhas is called a vyavasthāna­prajñapti.

source: །རྣམ་པར་གཞག་པ་གདགས་པ་ཕྲག་བརྒྱ་ན་རྒྱུ་རིག་ཅེས་བྱའོ།
en: One hundred vyavasthāna­prajñaptis is called a hetuhila.

source: །རྒྱུ་རིག་ཕྲག་བརྒྱ་ན་ལག་སྦྱིན་ཞེས་བྱའོ།
en: One hundred hetuhilas is called a karaphū.

source: །ལག་སྦྱིན་ཕྲག་བརྒྱ་ན་རྒྱུ་དབང་ཞེས་བྱའོ།
en: One hundred karaphūs is called a hetvindriya.

source: །རྒྱུ་དབང་ཕྲག་བརྒྱ་ན་རྫོགས་ཐོབ་ཅེས་བྱའོ།
en: One hundred hetvindriyas is called a samāptalambha.

source: །རྫོགས་ཐོབ་ཕྲག་བརྒྱ་ན་བགྲང་རྟོགས་ཞེས་བྱའོ།
en: One hundred samāptalambhas is called a gaṇanāgati.

source: །བགྲང་རྟོགས་ཕྲག་བརྒྱ་ན་སྒྲིབ་པ་ཞེས་བྱའོ།
en: One hundred gaṇanāgatis is called a niravadya.

source: །སྒྲིབ་པ་ཕྲག་བརྒྱ་ན་སྟོབས་ཞེས་བྱའོ།
en: One hundred niravadyas is called a mudrābala.

source: །སྟོབས་ཕྲག་བརྒྱ་ན་ཀུན་སྟོབས་ཞེས་བྱའོ།
en: One hundred mudrābalas is called a sarvabala.

source: །ཀུན་སྟོབས་ཕྲག་བརྒྱ་ན་རྣམ་པར་བརྡ་ཤེས་ལྡན་ཞེས་བྱའོ།
en: One hundred sarvabalas is called a visaṃjñāgati.

source: །རྣམ་པར་བརྡ་ཤེས་ལྡན་ཕྲག་བརྒྱ་ན་བརྡ་ཤེས་ཀུན་ཞེས་བྱའོ།
en: One hundred visaṃjñāgatis is called a sarvasaṃjña.

source: །བརྡ་ཤེས་ཀུན་ཕྲག་བརྒྱ་ན་རྣམ་འབྱུང་ཞེས་བྱའོ།
en: One hundred sarvasaṃjñas is called a vibhūtaṃgamā.

source: །རྣམ་འབྱུང་ཕྲག་བརྒྱ་ན་དེའི་མཚན་ཉིད་ཅེས་བྱ་སྟེ།
en: One hundred vibhūtaṃgamās is called a tallakṣaṇa.

source: འདི་ལྟར་དེའི་མཚན་ཉིད་ཅེས་བྱ་བའི་རྩིས་ཀྱིས་ནི་རིའི་རྒྱལ་པོ་རི་རབ་བརྩི་བའི་གཞིར་བྱས་ཀྱང་ཆོད་པར་རུང་ངོ་།
en: “If one uses tallakṣaṇa as the basic unit of calculation, it is feasible to calculate the size of Mount Meru, the king of mountains.

source: །དེ་ཡི་ཡང་གོང་ན་རྒྱལ་མཚན་གྱི་རྩེ་མོའི་ནོར་བུ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དེ།
en: Beyond that is the number called dhvajāgravatī.

source: གྲངས་དེས་ནི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བརྩི་བའི་གཞིར་བྱས་ཀྱང་ཆོད་པར་རུང་ངོ་།
en: If one uses dhvajāgravatī as the basic unit of calculation, it is possible to solve the calculation for all the grains of sand in the river Ganges.

source: །དེའི་ཡང་གོང་ན་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ངེས་པར་སྒྲོགས་པ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དོ།
en: Beyond that is the number called dhvajāgra­niśā­maṇī.

source: །དེའི་ཡང་གོང་ན་དེད་འདྲེན་གདགས་པ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དོ།
en: Next is the number called vāhanaprajñapti.

source: །དེའི་ཡང་གོང་ན་གཏན་ལ་འབེབས་པ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དོ།
en: Then comes the number called iṅgā.

source: །དེའི་ཡང་གོང་ན་གཅོད་རྟོགས་ཞེས་བྱ་བའི་གྲངས་ཡོད་དོ།
en: Beyond that is the number called kuruṭu.

source: །དེའི་ཡང་གོང་ན་གཅོད་རྟོགས་ལྡན་ཞེས་བྱ་བའི་གྲངས་ཡོད་དོ།
en: Then comes the number called kuruṭāvi.

source: །དེའི་ཡང་གོང་ན་ཐམས་ཅད་རྣམ་པར་འབྱེས་པ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དེ།
en: Then comes the number called sarvanikṣepā.

source: གྲངས་དེས་ནི་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་བརྩི་བའི་གཞིར་བྱས་ཀྱང་ཆོད་པར་རུང་ངོ་།
en: With this count serving as the basic unit of calculation, it is possible to calculate the number of grains of sand in ten Ganges rivers.

source: །དེའི་ཡང་གོང་ན་སྙིང་པོ་མཆོག་ཅེས་བྱ་བའི་གྲངས་ཡོད་དེ།
en: Beyond that is the number called agrasārā.

source: གྲངས་དེས་ནི་གང་གཱའི་ཀླུང་བྱེ་བ་ཕྲག་བརྒྱའི་བྱེ་མ་དང་མཉམ་པ་བརྩི་བའི་གཞིར་བྱས་ཀྱང་ཆོད་པར་རུང་ངོ་།
en: With this figure as the basic unit of calculation, it is possible to solve the calculation equal to the number of grains of sand in one billion Ganges rivers.

source: །དེའི་ཡང་གོང་ན་རྡུལ་ཕྲ་རབ་ལ་འཇུག་པའི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་གྲངས་ཡོད་དེ།
en: “Finally comes the number called application to the smallest particles (paramāṇu­rajaḥ­praveśānugata).

source: གྲངས་དེ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཆོས་ཐམས་ཅད་ལ་དབང་བསྐུར་བ་མངོན་དུ་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་གྲངས་དེ་ཤེས་པ་ནི་ང་དང་གཞན་ཡང་ང་དང་འདྲ་བ་སྲིད་པ་ཐ་མ་པར་གྱུར་པ་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་མ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པ་གང་ཡང་མེད་དོ། །
en: With the exception of a thus-gone one, a bodhisattva who dwells at the sublime seat of awakening, or a bodhisattva who is about to be initiated into all Dharmas, there is no other being who understands this number, with the exception of me and perhaps one like me, namely a bodhisattva in his final existence who has departed from the household.”

source: སྲིད་སྒྲུབ་ཀྱིས་སྨྲས་པ། གཞོན་ནུ་རྡུལ་ཕྲ་རབ་ལ་འཇུག་པའི་རྗེས་སུ་སོང་བའི་གྲངས་ལ་ཇི་ལྟར་རྗེས་སུ་འཇུག་པར་བགྱི།
en: Then Arjuna asked, “Child, how would you enumerate the number application to the smallest particles?”

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་བདུན་ལ་ནི་རྡུལ་ཕྲ་མོ་གཅིག་གོ།
en: The Bodhisattva answered, “Seven of the smallest particles is one small particle.

source: །རྡུལ་ཕྲ་མོ་བདུན་ལ་ནི་རྡུལ་ཆུང་ངུ་གཅིག་གོ།
en: Seven small particles is one water particle.

source: །རྡུལ་ཆུང་ངུ་བདུན་ལ་ནི་ཉི་ཟེར་གྱི་རྡུལ་གཅིག་གོ།
en: Seven water particles is one airborne dust particle.

source: །ཉི་ཟེར་གྱི་རྡུལ་བདུན་ལ་ནི་རི་བོང་རྡུལ་གཅིག་གོ།
en: Seven airborne dust particles is one dust particle on a hare.

source: །རི་བོང་རྡུལ་བདུན་ལ་ནི་ལུག་རྡུལ་གཅིག་གོ།
en: Seven dust particles on a hare is one dust particle on a sheep.

source: །ལུག་རྡུལ་བདུན་ལ་ནི་གླང་རྡུལ་གཅིག་གོ།
en: Seven dust particles on a sheep is one dust particle on a cow.

source: །གླང་རྡུལ་བདུན་ལ་ནི་སྲོ་མ་གཅིག་གོ།
en: Seven dust particles on a cow is one louse egg.

source: །སྲོ་མ་བདུན་ལ་ནི་ཡུངས་འབྲུ་གཅིག་གོ།
en: Seven lice eggs is one mustard seed.

source: །ཡུངས་འབྲུ་བདུན་ལ་ནི་ནས་གཅིག་གོ།
en: Seven mustard seeds is one barley grain.

source: །ནས་བདུན་ལ་ནི་སོར་གཅིག་གོ།
en: Seven barley grains is one finger joint.

source: །སོར་བཅུ་གཉིས་ལ་ནི་མཐོ་གང་ངོ་།
en: Twelve finger joints is one thumb tip to one index fingertip.

source: །མཐོ་དོ་ལ་ནི་ཁྲུ་གང་ངོ་།
en: Two measures of one thumb tip to one index fingertip is one cubit.

source: །ཁྲུ་བཞི་ལ་ནི་གཞུ་གང་ངོ་།
en: Four cubits is one bow.

source: །གཞུ་སྟོང་ལ་ནི་ཡུལ་མ་ག་དྷཱའི་རྒྱང་གྲགས་གཅིག་གོ།
en: One thousand bows is considered one earshot in Magadha.

source: །རྒྱང་གྲགས་བཞི་ལ་ནི་དཔག་ཚད་གཅིག་གོ།
en: Four times shouting-distance is one league.

source: །དེ་ལ་ཁྱེད་ཀྱིས་ནང་ནས་དཔག་ཚད་ལ་རྡུལ་ཕྲ་རབ་དེ་ལྟ་བུ་དུ་ཡོད་སུས་ཤེས།
en: Who among you knows the total number of smallest particles in a league?”

source: སྲིད་སྒྲུབ་ཀྱིས་སྨྲས་པ། གཞོན་ནུ་བདག་ཉིད་ཀྱང་དེ་ལ་མགོ་རྨོངས་ན་གཞན་བློ་ཆུང་ངུ་དང་ལྡན་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: “Well,” said Arjuna. “I am uncertain about this. So, child, how much more so will the others, who are of weaker intellect, be confused?

source: དེ་བས་ན་གཞོན་ནུས་དཔག་ཚད་ལ་རྡུལ་ཕྲ་རབ་དེ་ལྟ་བུ་དུ་མཆིས་བཤད་དུ་གསོལ།
en: Child, please explain how many of the smallest particles make up a league.”

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། དེ་ལ་དཔག་ཚད་ལ་ནི་རྡུལ་ཕྲ་རབ་མི་འཁྲུགས་ཁྲག་ཁྲིག་གཅིག་དང་། བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་སུམ་ཅུ་དང་། བྱེ་བ་དྲུག་ཅུ་ཕྲག་བརྒྱ་དང་། བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་དང་། འབུམ་ཕྲག་ལྔ་དང་། ཁྲི་ཉིས་སྟོང་ཡོད་དེ། དཔག་ཚད་ལ་ནི་རྡུལ་ཕྲ་རབ་དེ་སྙེད་ཅིག་ཡོད་དོ།
en: The Bodhisattva explained, “A league contains 100 billion nonillions, 30 quintillions, 60 billion, 320 million, 512 thousand smallest particles. Such is the sum of smallest particles in a league.

source: །དེ་ལྟར་འཇུག་པ་དེས་འཛམ་བུའི་གླིང་འདི་ལ་ནི་དཔག་ཚད་བདུན་སྟོང་ཡོད་དོ། །ནུབ་ཀྱི་བ་ལང་སྤྱོད་ལ་ནི་དཔག་ཚད་བརྒྱད་སྟོང་ཡོད་དོ།
en: There are seven thousand leagues here in Jambudvīpa, eight thousand leagues in the western continent of Godānīya, nine thousand leagues in the eastern continent of Videha, and ten thousand leagues in the northern continent of Kuru.

source: །ཤར་གྱི་ལུས་འཕགས་ལ་ནི་དཔག་ཚད་དགུ་སྟོང་ཡོད་དོ།
en: “Moreover, there are one billion worlds of four continents, such as this world, and one billion oceans.

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ནི་དཔག་ཚད་ཁྲི་ཡོད་དེ། དེ་ལྟར་འཇུག་པ་དེས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལ་སོགས་པ་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རྒྱ་མཚོ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཁོར་ཡུག་དང་འཁོར་ཡུག་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སུམ་ཅུ་རྩ་གསུམ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཐབ་བྲལ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། དགའ་ལྡན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཕྲུལ་དགའ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚངས་རིས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚངས་པའི་མདུན་ན་འདོན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚངས་འཁོར་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚངས་ཆེན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འོད་ཆུང་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚད་མེད་འོད་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འོད་གསལ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། དགེ་ཆུང་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཚད་མེད་དགེ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། དགེ་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སྤྲིན་མེད་བྱེ་བ་ཕྲག་བརྒྱ་དང་། བསོད་ནམས་སྐྱེས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འབྲས་བུ་ཆེ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སེམས་ཅན་འདུ་ཤེས་མེད་པ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། མི་ཆེ་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། མི་གདུང་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། གྱ་ནོམ་སྣང་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཤིན་ཏུ་མཐོང་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འོག་མིན་གྱི་ལྷའི་རིས་བྱེ་བ་ཕྲག་བརྒྱ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཅེས་བྱ་སྟེ།
en: There are also one billion surrounding mountain ranges and one billion outer ranges. Likewise there are one billion Mount Merus, the kings of mountains. “There are one billion god realms belonging to the Four Great Kings. There are one billion Heavens of the Thirty-Three, one billion Heavens Free from Strife, one billion Heavens of Joy, one billion Heavens of Delighting in Emanations, and one billion Heavens of Making Use of Others’ Emanations. “There are also one billion Brahma Realms, one billion realms of the High Priests of Brahmā, one billion realms of Brahmā’s Entourage, one billion realms of Great Brahmā, one billion realms of Limited Light, one billion realms of Limitless Light, one billion realms of the Luminous Heaven, one billion realms of the Heaven of Limited Virtue, one billion realms of the Heaven of Limitless Virtue, one billion realms of the Heaven of Perfected Virtue, one billion realms of the Cloudless Heaven, one billion realms of the Heaven of Increased Merit, one billion realms of the Heaven of Great Fruition, one billion realms of the Heaven of Concept-Free Beings, one billion realms of the Unlofty Heaven, one billion realms of the Heaven of No Hardship, one billion realms of the Sublime Heaven, one billion realms of the Gorgeous Heaven, and one billion realms of the Gods of the Highest Heaven. All of this is called a great trichiliocosm.

source: ཡངས་ཤིང་རྒྱ་ཆེ་བ་དེ་ལ་དཔག་ཚད་དུ་ཡོད་པ་དང་། དཔག་ཚད་བརྒྱ་ཕྲག་དུ་ཡོད་པ་དང་། དཔག་ཚད་སྟོང་ཕྲག་དུ་ཡོད་པ་དང་། དཔག་ཚད་བྱེ་བ་ཕྲག་དུ་ཡོད་པ་དང་། དཔག་ཚད་ཐེར་འབུམ་ཕྲག་དུ་ཡོད་པ་དང་། དཔག་ཚད་ཁྲག་ཁྲིག་ཕྲག་དུ་ཡོད་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: “In width and breadth, each world system contains leagues measuring in the hundreds, thousands, ten millions, billions, hundred billions, and so on, all the way up to the measure of an agrasārā.

source: དཔག་ཚད་སྙིང་པོ་དམ་པའི་རྩིས་ཀྱི་བར་དུ་ཐུག་པ་ལ་རྡུལ་ཕྲ་རབ་དེ་ལྟ་བུ་དུ་ཡོད་ཅེས་བྱ་བའི་རྩིས་དེ་ནི་གྲངས་དང་བགྲང་བ་ལས་འདས་པ་སྟེ། དེ་ནི་གྲངས་མེད་པ་ཞེས་བྱའོ།
en: There is also a corresponding measure of the smallest particles. The number of these particles can indeed be calculated but, since it is unfathomable, it is called incalculable.
